analogdevicesinc/aducm355-examples/inc/ADuCM355_cdef.h
/*  =================================================================================
 *      Serial Peripheral Interface (SPI0)
 *  ================================================================================= */
#define pREG_SPI0_STAT                   ((__IO     uint16_t  *) REG_SPI0_STAT)                   /*  Status */
#define pREG_SPI0_RX                     ((__I      uint16_t  *) REG_SPI0_RX)                     /*  Receive */
#define pREG_SPI0_TX                     ((__O      uint16_t  *) REG_SPI0_TX)                     /*  Transmit */
#define pREG_SPI0_DIV                    ((__IO     uint16_t  *) REG_SPI0_DIV)                    /*  SPI baud rate selection */
#define pREG_SPI0_CTL                    ((__IO     uint16_t  *) REG_SPI0_CTL)                    /*  SPI configuration 1 */
#define pREG_SPI0_IEN                    ((__IO     uint16_t  *) REG_SPI0_IEN)                    /*  SPI configuration 2 */
#define pREG_SPI0_CNT                    ((__IO     uint16_t  *) REG_SPI0_CNT)                    /*  Transfer byte count */
#define pREG_SPI0_DMA                    ((__IO     uint16_t  *) REG_SPI0_DMA)                    /*  SPI DMA enable */
#define pREG_SPI0_FIFO_STAT              ((__I      uint16_t  *) REG_SPI0_FIFO_STAT)              /*  FIFO Status */
#define pREG_SPI0_RD_CTL                 ((__IO     uint16_t  *) REG_SPI0_RD_CTL)                 /*  Read Control */
#define pREG_SPI0_FLOW_CTL               ((__IO     uint16_t  *) REG_SPI0_FLOW_CTL)               /*  Flow Control */
#define pREG_SPI0_WAIT_TMR               ((__IO     uint16_t  *) REG_SPI0_WAIT_TMR)               /*  Wait timer for flow control */
#define pREG_SPI0_CS_CTL                 ((__IO     uint16_t  *) REG_SPI0_CS_CTL)                 /*  Chip-Select control for multi-slave connections */
#define pREG_SPI0_CS_OVERRIDE            ((__IO     uint16_t  *) REG_SPI0_CS_OVERRIDE)            /*  Chip-Select Override */

/*  =================================================================================
 *      Serial Peripheral Interface (SPI1)
 *  ================================================================================= */
#define pREG_SPI1_STAT                   ((__IO     uint16_t  *) REG_SPI1_STAT)                   /*  Status */
#define pREG_SPI1_RX                     ((__I      uint16_t  *) REG_SPI1_RX)                     /*  Receive */
#define pREG_SPI1_TX                     ((__O      uint16_t  *) REG_SPI1_TX)                     /*  Transmit */
#define pREG_SPI1_DIV                    ((__IO     uint16_t  *) REG_SPI1_DIV)                    /*  SPI baud rate selection */
#define pREG_SPI1_CTL                    ((__IO     uint16_t  *) REG_SPI1_CTL)                    /*  SPI configuration 1 */
#define pREG_SPI1_IEN                    ((__IO     uint16_t  *) REG_SPI1_IEN)                    /*  SPI configuration 2 */
#define pREG_SPI1_CNT                    ((__IO     uint16_t  *) REG_SPI1_CNT)                    /*  Transfer byte count */
#define pREG_SPI1_DMA                    ((__IO     uint16_t  *) REG_SPI1_DMA)                    /*  SPI DMA enable */
#define pREG_SPI1_FIFO_STAT              ((__I      uint16_t  *) REG_SPI1_FIFO_STAT)              /*  FIFO Status */
#define pREG_SPI1_RD_CTL                 ((__IO     uint16_t  *) REG_SPI1_RD_CTL)                 /*  Read Control */
#define pREG_SPI1_FLOW_CTL               ((__IO     uint16_t  *) REG_SPI1_FLOW_CTL)               /*  Flow Control */
#define pREG_SPI1_WAIT_TMR               ((__IO     uint16_t  *) REG_SPI1_WAIT_TMR)               /*  Wait timer for flow control */
#define pREG_SPI1_CS_CTL                 ((__IO     uint16_t  *) REG_SPI1_CS_CTL)                 /*  Chip-Select control for multi-slave connections */
#define pREG_SPI1_CS_OVERRIDE            ((__IO     uint16_t  *) REG_SPI1_CS_OVERRIDE)            /*  Chip-Select Override */

/*  =================================================================================
 *       (UART0)
 *  ================================================================================= */
#define pREG_UART0_COMRX                 ((__I      uint16_t  *) REG_UART0_COMRX)                 /*  Receive Buffer Register */
#define pREG_UART0_COMTX                 ((__O      uint16_t  *) REG_UART0_COMTX)                 /*  Transmit Holding Register */
#define pREG_UART0_COMIEN                ((__IO     uint16_t  *) REG_UART0_COMIEN)                /*  Interrupt Enable */
#define pREG_UART0_COMIIR                ((__I      uint16_t  *) REG_UART0_COMIIR)                /*  Interrupt ID */
#define pREG_UART0_COMLCR                ((__IO     uint16_t  *) REG_UART0_COMLCR)                /*  Line Control */
#define pREG_UART0_COMMCR                ((__IO     uint16_t  *) REG_UART0_COMMCR)                /*  Modem Control */
#define pREG_UART0_COMLSR                ((__I      uint16_t  *) REG_UART0_COMLSR)                /*  Line Status */
#define pREG_UART0_COMMSR                ((__I      uint16_t  *) REG_UART0_COMMSR)                /*  Modem Status */
#define pREG_UART0_COMSCR                ((__IO     uint16_t  *) REG_UART0_COMSCR)                /*  Scratch buffer */
#define pREG_UART0_COMFCR                ((__IO     uint16_t  *) REG_UART0_COMFCR)                /*  FIFO Control */
#define pREG_UART0_COMFBR                ((__IO     uint16_t  *) REG_UART0_COMFBR)                /*  Fractional Baud Rate */
#define pREG_UART0_COMDIV                ((__IO     int16_t   *) REG_UART0_COMDIV)                /*  Baudrate divider */
#define pREG_UART0_COMLCR2               ((__IO     uint16_t  *) REG_UART0_COMLCR2)               /*  second Line Control */
#define pREG_UART0_COMCTL                ((__IO     uint16_t  *) REG_UART0_COMCTL)                /*  UART control register */
#define pREG_UART0_COMRFC                ((__I      uint16_t  *) REG_UART0_COMRFC)                /*  RX FIFO byte count */
#define pREG_UART0_COMTFC                ((__I      uint16_t  *) REG_UART0_COMTFC)                /*  TX FIFO byte count */
#define pREG_UART0_COMRSC                ((__IO     uint16_t  *) REG_UART0_COMRSC)                /*  RS485 half-duplex Control */
#define pREG_UART0_COMACR                ((__IO     uint16_t  *) REG_UART0_COMACR)                /*  Auto Baud Control */
#define pREG_UART0_COMASRL               ((__I      uint16_t  *) REG_UART0_COMASRL)               /*  Auto Baud Status (Low) */
#define pREG_UART0_COMASRH               ((__I      uint16_t  *) REG_UART0_COMASRH)               /*  Auto Baud Status (High) */

