analogdevicesinc/aducm355-examples/inc/ADuCM355_cdef.h
/*  =================================================================================
 *      Power Management  (PMG0)
 *  ================================================================================= */
#define pREG_PMG0_IEN                    ((__IO     uint32_t  *) REG_PMG0_IEN)                    /*  Power Supply Monitor Interrupt Enable */
#define pREG_PMG0_PSM_STAT               ((__IO     uint32_t  *) REG_PMG0_PSM_STAT)               /*  Power supply monitor status */
#define pREG_PMG0_PWRMOD                 ((__IO     uint32_t  *) REG_PMG0_PWRMOD)                 /*  Power Mode Register */
#define pREG_PMG0_PWRKEY                 ((__O      uint32_t  *) REG_PMG0_PWRKEY)                 /*  Key protection for PWRMOD and  SRAMRET */
#define pREG_PMG0_SHDN_STAT              ((__I      uint32_t  *) REG_PMG0_SHDN_STAT)              /*  SHUTDOWN Status Register */
#define pREG_PMG0_SRAMRET                ((__IO     uint32_t  *) REG_PMG0_SRAMRET)                /*  Control for Retention SRAM during HIBERNATE Mode */
#define pREG_PMG0_RST_STAT               ((__IO     uint32_t  *) REG_PMG0_RST_STAT)               /*  Reset status */
#define pREG_PMG0_CTL1                   ((__IO     uint32_t  *) REG_PMG0_CTL1)                   /*  HPBUCK control */

/*  =================================================================================
 *      External interrupt configuration (XINT0)
 *  ================================================================================= */
#define pREG_XINT0_CFG0                  ((__IO     uint32_t  *) REG_XINT0_CFG0)                  /*  External Interrupt Configuration */
#define pREG_XINT0_EXT_STAT              ((__I      uint32_t  *) REG_XINT0_EXT_STAT)              /*  External Wakeup Interrupt Status */
#define pREG_XINT0_CLR                   ((__IO     uint32_t  *) REG_XINT0_CLR)                   /*  External Interrupt Clear */
#define pREG_XINT0_NMICLR                ((__IO     uint32_t  *) REG_XINT0_NMICLR)                /*  Non-Maskable Interrupt Clear */

/*  =================================================================================
 *      Clocking  (CLKG0_OSC)
 *  ================================================================================= */
#define pREG_CLKG0_OSC_KEY               ((__O      uint32_t  *) REG_CLKG0_OSC_KEY)               /*  Key Protection for OSCCTRL */
#define pREG_CLKG0_OSC_CTL               ((__IO     uint32_t  *) REG_CLKG0_OSC_CTL)               /*  Oscillator Control */

/*  =================================================================================
 *      Power Management  (PMG0_TST)
 *  ================================================================================= */
#define pREG_PMG0_TST_SRAM_CTL           ((__IO     uint32_t  *) REG_PMG0_TST_SRAM_CTL)           /*  Control for SRAM parity and instruction SRAM */
#define pREG_PMG0_TST_SRAM_INITSTAT      ((__IO     uint32_t  *) REG_PMG0_TST_SRAM_INITSTAT)      /*  Initialization Status Register */
#define pREG_PMG0_TST_CLR_LATCH_GPIOS    ((__O      uint16_t  *) REG_PMG0_TST_CLR_LATCH_GPIOS)    /*  CLEAR GPIO AFTER SHUTDOWN MODE */
#define pREG_PMG0_TST_SCRPAD_IMG         ((__IO     uint32_t  *) REG_PMG0_TST_SCRPAD_IMG)         /*  SCRATCH PAD IMAGE */
#define pREG_PMG0_TST_SCRPAD_3V_RD       ((__I      uint32_t  *) REG_PMG0_TST_SCRPAD_3V_RD)       /*  SCRATCH PAD SAVED IN BATTERY DOMAIN */

/*  =================================================================================
 *      Clocking  (CLKG0_CLK)
 *  ================================================================================= */
#define pREG_CLKG0_CLK_CTL0              ((__IO     uint32_t  *) REG_CLKG0_CLK_CTL0)              /*  Misc clock settings */
#define pREG_CLKG0_CLK_CTL1              ((__IO     uint32_t  *) REG_CLKG0_CLK_CTL1)              /*  Clock dividers */
#define pREG_CLKG0_CLK_CTL3              ((__IO     uint32_t  *) REG_CLKG0_CLK_CTL3)              /*  System PLL */
#define pREG_CLKG0_CLK_CTL5              ((__IO     uint32_t  *) REG_CLKG0_CLK_CTL5)              /*  User clock gating control */
#define pREG_CLKG0_CLK_STAT0             ((__IO     uint32_t  *) REG_CLKG0_CLK_STAT0)             /*  Clocking status */

/*  =================================================================================
 *      Bus matrix (BUSM0)
 *  ================================================================================= */
#define pREG_BUSM0_ARBIT0                ((__IO     uint32_t  *) REG_BUSM0_ARBIT0)                /*  Arbitration Priority Configuration for FLASH and SRAM0 */
#define pREG_BUSM0_ARBIT1                ((__IO     uint32_t  *) REG_BUSM0_ARBIT1)                /*  Arbitration Priority Configuration for SRAM1 and SIP */
#define pREG_BUSM0_ARBIT2                ((__IO     uint32_t  *) REG_BUSM0_ARBIT2)                /*  Arbitration Priority Configuration for APB32 and APB16 */
#define pREG_BUSM0_ARBIT3                ((__IO     uint32_t  *) REG_BUSM0_ARBIT3)                /*  Arbitration Priority Configuration for APB16 priority for core and for DMA1 */

/*  =================================================================================
 *       (AGPIO2)
 *  ================================================================================= */
#define pREG_AGPIO2_CON                  ((__IO     uint32_t  *) REG_AGPIO2_CON)                  /*  GPIO Port Configuration */
#define pREG_AGPIO2_OEN                  ((__IO     uint16_t  *) REG_AGPIO2_OEN)                  /*  GPIO Port Output Enable */
#define pREG_AGPIO2_PE                   ((__IO     uint16_t  *) REG_AGPIO2_PE)                   /*  GPIO Port Pullup/Pulldown Enable */
#define pREG_AGPIO2_IEN                  ((__IO     uint16_t  *) REG_AGPIO2_IEN)                  /*  GPIO Port Input Path Enable */
#define pREG_AGPIO2_IN                   ((__I      uint16_t  *) REG_AGPIO2_IN)                   /*  GPIO Port Registered Data Input */
#define pREG_AGPIO2_OUT                  ((__IO     uint16_t  *) REG_AGPIO2_OUT)                  /*  GPIO Port Data Output */
#define pREG_AGPIO2_SET                  ((__O      uint16_t  *) REG_AGPIO2_SET)                  /*  GPIO Port Data Out Set */
#define pREG_AGPIO2_CLR                  ((__O      uint16_t  *) REG_AGPIO2_CLR)                  /*  GPIO Port Data Out Clear */
#define pREG_AGPIO2_TGL                  ((__O      uint16_t  *) REG_AGPIO2_TGL)                  /*  GPIO Port Pin Toggle */

