analogdevicesinc/aducm355-examples/inc/ADuCM355_cdef.h
/*  =================================================================================
 *       (AFECON)
 *  ================================================================================= */
#define pREG_AFECON_ADIID                ((__I      uint16_t  *) REG_AFECON_ADIID)                /*  ADI Identification */
#define pREG_AFECON_CHIPID               ((__I      uint16_t  *) REG_AFECON_CHIPID)               /*  Chip Identification */
#define pREG_AFECON_CLKCON0              ((__IO     uint16_t  *) REG_AFECON_CLKCON0)              /*  Clock Divider Configuration */
#define pREG_AFECON_CLKEN1               ((__IO     uint16_t  *) REG_AFECON_CLKEN1)               /*  Clock Gate Enable */
#define pREG_AFECON_CLKSEL               ((__IO     uint16_t  *) REG_AFECON_CLKSEL)               /*  Clock Select */
#define pREG_AFECON_GPIOCLKMUXSEL        ((__IO     uint16_t  *) REG_AFECON_GPIOCLKMUXSEL)        /*  GPIO Clock MUX Select */
#define pREG_AFECON_CLKCON0KEY           ((__IO     uint16_t  *) REG_AFECON_CLKCON0KEY)           /*  Enable Clock Division to 8Mhz,4Mhz and 2Mhz */
#define pREG_AFECON_MKEY                 ((__O      uint16_t  *) REG_AFECON_MKEY)                 /*  MKEY */
#define pREG_AFECON_DSPUPDATEEN          ((__IO     uint16_t  *) REG_AFECON_DSPUPDATEEN)          /*  DSP Update Enable */

/*  =================================================================================
 *       (AFEWDT)
 *  ================================================================================= */
#define pREG_AFEWDT_WDTLD                ((__IO     int16_t   *) REG_AFEWDT_WDTLD)                /*  Watchdog Timer Load Value */
#define pREG_AFEWDT_WDTVALS              ((__I      int16_t   *) REG_AFEWDT_WDTVALS)              /*  Current Count Value */
#define pREG_AFEWDT_WDTCON               ((__IO     uint16_t  *) REG_AFEWDT_WDTCON)               /*  Watchdog Timer Control Register */
#define pREG_AFEWDT_WDTCLRI              ((__O      int16_t   *) REG_AFEWDT_WDTCLRI)              /*  Refresh Watchdog Register */
#define pREG_AFEWDT_WDTSTA               ((__IO     uint16_t  *) REG_AFEWDT_WDTSTA)               /*  Timer Status */
#define pREG_AFEWDT_WDTMINLD             ((__IO     int16_t   *) REG_AFEWDT_WDTMINLD)             /*  Minimum Load Value */

/*  =================================================================================
 *      Always On Register (ALLON)
 *  ================================================================================= */
#define pREG_ALLON_PWRMOD                ((__IO     uint16_t  *) REG_ALLON_PWRMOD)                /*  Power Modes */
#define pREG_ALLON_PWRKEY                ((__IO     int16_t   *) REG_ALLON_PWRKEY)                /*  Key Protection for PWRMOD */
#define pREG_ALLON_OSCKEY                ((__IO     int16_t   *) REG_ALLON_OSCKEY)                /*  Key Protection for OSCCON */
#define pREG_ALLON_OSCCON                ((__IO     uint16_t  *) REG_ALLON_OSCCON)                /*  Oscillator Control */
#define pREG_ALLON_EI2CON                ((__IO     uint16_t  *) REG_ALLON_EI2CON)                /*  External Interrupt Configuration 2 */
#define pREG_ALLON_EICLR                 ((__IO     uint16_t  *) REG_ALLON_EICLR)                 /*  External Interrupt Clear */
#define pREG_ALLON_RSTSTA                ((__IO     uint16_t  *) REG_ALLON_RSTSTA)                /*  Reset Status */
#define pREG_ALLON_PMUSTA                ((__I      uint16_t  *) REG_ALLON_PMUSTA)                /*  PMU Status */
#define pREG_ALLON_CLKEN0                ((__IO     uint16_t  *) REG_ALLON_CLKEN0)                /*  32KHz Peripheral Clock Enable */

/*  =================================================================================
 *      General Purpose Timer (AGPT0)
 *  ================================================================================= */
#define pREG_AGPT0_LD0                   ((__IO     int16_t   *) REG_AGPT0_LD0)                   /*  16-bit Load Value Register. */
#define pREG_AGPT0_VAL0                  ((__I      int16_t   *) REG_AGPT0_VAL0)                  /*  16-Bit Timer Value Register. */
#define pREG_AGPT0_CON0                  ((__IO     uint16_t  *) REG_AGPT0_CON0)                  /*  Control Register. */
#define pREG_AGPT0_CLRI0                 ((__O      uint16_t  *) REG_AGPT0_CLRI0)                 /*  Clear Interrupt Register. */
#define pREG_AGPT0_CAP0                  ((__I      int16_t   *) REG_AGPT0_CAP0)                  /*  Capture Register. */
#define pREG_AGPT0_ALD0                  ((__IO     int16_t   *) REG_AGPT0_ALD0)                  /*  16-Bit Load Value, Asynchronous. */
#define pREG_AGPT0_AVAL0                 ((__I      int16_t   *) REG_AGPT0_AVAL0)                 /*  16-Bit Timer Value, Asynchronous Register. */
#define pREG_AGPT0_STA0                  ((__I      uint16_t  *) REG_AGPT0_STA0)                  /*  Status Register. */
#define pREG_AGPT0_PWMCON0               ((__IO     uint16_t  *) REG_AGPT0_PWMCON0)               /*  PWM Control Register. */
#define pREG_AGPT0_PWMMAT0               ((__IO     int16_t   *) REG_AGPT0_PWMMAT0)               /*  PWM Match Value Register. */
#define pREG_AGPT0_INTEN                 ((__IO     uint16_t  *) REG_AGPT0_INTEN)                 /*  Interrupt Enable */

/*  =================================================================================
 *      General Purpose Timer (AGPT1)
 *  ================================================================================= */
#define pREG_AGPT1_LD1                   ((__IO     int16_t   *) REG_AGPT1_LD1)                   /*  16-bit Load Value Register */
#define pREG_AGPT1_VAL1                  ((__I      int16_t   *) REG_AGPT1_VAL1)                  /*  16-bit Timer Value Register */
#define pREG_AGPT1_CON1                  ((__IO     uint16_t  *) REG_AGPT1_CON1)                  /*  Control Register */
#define pREG_AGPT1_CLRI1                 ((__O      uint16_t  *) REG_AGPT1_CLRI1)                 /*  Clear Interrupt Register */
#define pREG_AGPT1_CAP1                  ((__I      int16_t   *) REG_AGPT1_CAP1)                  /*  Capture Register */
#define pREG_AGPT1_ALD1                  ((__IO     int16_t   *) REG_AGPT1_ALD1)                  /*  16-bit Load Value, Asynchronous Register */
#define pREG_AGPT1_AVAL1                 ((__I      int16_t   *) REG_AGPT1_AVAL1)                 /*  16-bit Timer Value, Asynchronous Register */
#define pREG_AGPT1_STA1                  ((__I      uint16_t  *) REG_AGPT1_STA1)                  /*  Status Register */
#define pREG_AGPT1_PWMCON1               ((__IO     uint16_t  *) REG_AGPT1_PWMCON1)               /*  PWM Control Register */
#define pREG_AGPT1_PWMMAT1               ((__IO     int16_t   *) REG_AGPT1_PWMMAT1)               /*  PWM Match Value Register */
#define pREG_AGPT1_INTEN1                ((__IO     uint16_t  *) REG_AGPT1_INTEN1)                /*  Interrupt Enable */

