analogdevicesinc/aducm355-examples/inc/ADuCM355_cdef.h
/*  =================================================================================
 *      CRC Accelerator (AFECRC)
 *  ================================================================================= */
#define pREG_AFECRC_CTL                  ((__IO     uint32_t  *) REG_AFECRC_CTL)                  /*  CRC Control Register */
#define pREG_AFECRC_IPDATA               ((__O      int32_t   *) REG_AFECRC_IPDATA)               /*  Data Input. */
#define pREG_AFECRC_RESULT               ((__IO     int32_t   *) REG_AFECRC_RESULT)               /*  CRC Residue */
#define pREG_AFECRC_POLY                 ((__IO     uint32_t  *) REG_AFECRC_POLY)                 /*  CRC Reduction Polynomial */
#define pREG_AFECRC_IPBITS               ((__O      uint8_t   *) REG_AFECRC_IPBITS)               /*  Input Data Bits */
#define pREG_AFECRC_IPBYTE               ((__O      uint8_t   *) REG_AFECRC_IPBYTE)               /*  Input Data Byte */
#define pREG_AFECRC_CRC_SIG_COMP         ((__IO     uint32_t  *) REG_AFECRC_CRC_SIG_COMP)         /*  CRC Signature Compare Data Input. */
#define pREG_AFECRC_CRCINTEN             ((__IO     uint32_t  *) REG_AFECRC_CRCINTEN)             /*  CRC Error Interrupt Enable Bit */
#define pREG_AFECRC_INTSTA               ((__IO     uint32_t  *) REG_AFECRC_INTSTA)               /*  CRC Error Interrupt Status Bit */

/*  =================================================================================
 *       (AFE)
 *  ================================================================================= */
#define pREG_AFE_AFECON                  ((__IO     uint32_t  *) REG_AFE_AFECON)                  /*  AFE Configuration */
#define pREG_AFE_SWCON                   ((__IO     uint32_t  *) REG_AFE_SWCON)                   /*  Switch Matrix Configuration */
#define pREG_AFE_HSDACCON                ((__IO     uint32_t  *) REG_AFE_HSDACCON)                /*  High Speed DAC Configuration */
#define pREG_AFE_WGCON                   ((__IO     uint32_t  *) REG_AFE_WGCON)                   /*  Waveform Generator Configuration */
#define pREG_AFE_WGFCW                   ((__IO     uint32_t  *) REG_AFE_WGFCW)                   /*  Waveform Generator - Sinusoid Frequency Control Word */
#define pREG_AFE_WGPHASE                 ((__IO     uint32_t  *) REG_AFE_WGPHASE)                 /*  Waveform Generator - Sinusoid Phase Offset */
#define pREG_AFE_WGOFFSET                ((__IO     uint32_t  *) REG_AFE_WGOFFSET)                /*  Waveform Generator - Sinusoid Offset */
#define pREG_AFE_WGAMPLITUDE             ((__IO     uint32_t  *) REG_AFE_WGAMPLITUDE)             /*  Waveform Generator - Sinusoid Amplitude */
#define pREG_AFE_ADCFILTERCON            ((__IO     uint32_t  *) REG_AFE_ADCFILTERCON)            /*  ADC Output Filters Configuration */
#define pREG_AFE_HSDACDAT                ((__IO     uint32_t  *) REG_AFE_HSDACDAT)                /*  HS DAC Code */
#define pREG_AFE_LPREFBUFCON             ((__IO     uint32_t  *) REG_AFE_LPREFBUFCON)             /*  LPREF_BUF_CON */
#define pREG_AFE_ADCDAT                  ((__IO     uint32_t  *) REG_AFE_ADCDAT)                  /*  ADC Raw Result */
#define pREG_AFE_DFTREAL                 ((__IO     uint32_t  *) REG_AFE_DFTREAL)                 /*  DFT Result, Real Part */
#define pREG_AFE_DFTIMAG                 ((__IO     uint32_t  *) REG_AFE_DFTIMAG)                 /*  DFT Result, Imaginary Part */
#define pREG_AFE_SINC2DAT                ((__IO     uint32_t  *) REG_AFE_SINC2DAT)                /*  Supply Rejection Filter Result */
#define pREG_AFE_TEMPSENSDAT             ((__IO     uint32_t  *) REG_AFE_TEMPSENSDAT)             /*  Temperature Sensor Result */
#define pREG_AFE_ADCINTIEN               ((__IO     uint32_t  *) REG_AFE_ADCINTIEN)               /*  ADC Interrupt Enable Register */
#define pREG_AFE_ADCINTSTA               ((__IO     uint32_t  *) REG_AFE_ADCINTSTA)               /*  ADC Interrupt Status */
#define pREG_AFE_AFEGENINTSTA            ((__IO     uint32_t  *) REG_AFE_AFEGENINTSTA)            /*  Analog Generation Interrupt */
#define pREG_AFE_ADCMIN                  ((__IO     uint32_t  *) REG_AFE_ADCMIN)                  /*  ADC Minimum Value Check */
#define pREG_AFE_ADCMINSM                ((__IO     uint32_t  *) REG_AFE_ADCMINSM)                /*  ADCMIN Hysteresis Value */
#define pREG_AFE_ADCMAX                  ((__IO     uint32_t  *) REG_AFE_ADCMAX)                  /*  ADC Maximum Value Check */
#define pREG_AFE_ADCMAXSMEN              ((__IO     uint32_t  *) REG_AFE_ADCMAXSMEN)              /*  ADCMAX Hysteresis Value */
#define pREG_AFE_ADCDELTA                ((__IO     uint32_t  *) REG_AFE_ADCDELTA)                /*  ADC Delta Value */
#define pREG_AFE_HPOSCCON                ((__IO     uint32_t  *) REG_AFE_HPOSCCON)                /*  HPOSC Configuration */
#define pREG_AFE_DFTCON                  ((__IO     uint32_t  *) REG_AFE_DFTCON)                  /*  AFE DSP Configuration */
#define pREG_AFE_LPTIASW1                ((__IO     uint32_t  *) REG_AFE_LPTIASW1)                /*  ULPTIA Switch Configuration for Channel 1 */
#define pREG_AFE_LPTIASW0                ((__IO     uint32_t  *) REG_AFE_LPTIASW0)                /*  ULPTIA Switch Configuration for Channel 0 */
#define pREG_AFE_LPTIACON1               ((__IO     uint32_t  *) REG_AFE_LPTIACON1)               /*  ULPTIA Control Bits Channel 1 */
#define pREG_AFE_LPTIACON0               ((__IO     uint32_t  *) REG_AFE_LPTIACON0)               /*  ULPTIA Control Bits Channel 0 */
#define pREG_AFE_HSRTIACON               ((__IO     uint32_t  *) REG_AFE_HSRTIACON)               /*  High Power RTIA Configuration */
#define pREG_AFE_DE1RESCON               ((__IO     uint32_t  *) REG_AFE_DE1RESCON)               /*  DE1 HSTIA Resistors Configuration */
#define pREG_AFE_DE0RESCON               ((__IO     uint32_t  *) REG_AFE_DE0RESCON)               /*  DE0 HSTIA Resistors Configuration */
#define pREG_AFE_HSTIACON                ((__IO     uint32_t  *) REG_AFE_HSTIACON)                /*  HSTIA Amplifier Configuration */
#define pREG_AFE_DACDCBUFCON             ((__IO     uint32_t  *) REG_AFE_DACDCBUFCON)             /*  DAC DC Buffer Configuration */
#define pREG_AFE_LPDACDAT0               ((__IO     uint32_t  *) REG_AFE_LPDACDAT0)               /*  LPDAC Data-out */
#define pREG_AFE_LPDACSW0                ((__IO     uint32_t  *) REG_AFE_LPDACSW0)                /*  LPDAC0 Switch Control */
#define pREG_AFE_LPDACCON0               ((__IO     uint32_t  *) REG_AFE_LPDACCON0)               /*  LPDAC Control Bits */
#define pREG_AFE_LPDACDAT1               ((__IO     uint32_t  *) REG_AFE_LPDACDAT1)               /*  Low Power DAC1 data register */
#define pREG_AFE_LPDACSW1                ((__IO     uint32_t  *) REG_AFE_LPDACSW1)                /*  Control register for switches to LPDAC1 */
#define pREG_AFE_LPDACCON1               ((__IO     uint32_t  *) REG_AFE_LPDACCON1)               /*  ULP_DACCON1 */
#define pREG_AFE_DSWFULLCON              ((__IO     uint32_t  *) REG_AFE_DSWFULLCON)              /*  Switch Matrix Full Configuration (D) */
#define pREG_AFE_NSWFULLCON              ((__IO     uint32_t  *) REG_AFE_NSWFULLCON)              /*  Switch Matrix Full Configuration (N) */
#define pREG_AFE_PSWFULLCON              ((__IO     uint32_t  *) REG_AFE_PSWFULLCON)              /*  Switch Matrix Full Configuration (P) */
#define pREG_AFE_TSWFULLCON              ((__IO     uint32_t  *) REG_AFE_TSWFULLCON)              /*  Switch Matrix Full Configuration (T) */
#define pREG_AFE_TEMPCON0                ((__IO     uint32_t  *) REG_AFE_TEMPCON0)                /*  Temp Sensor Configuration */
#define pREG_AFE_BUFSENCON               ((__IO     uint32_t  *) REG_AFE_BUFSENCON)               /*  HP and LP Buffer Control */
#define pREG_AFE_ADCCON                  ((__IO     uint32_t  *) REG_AFE_ADCCON)                  /*  ADC Configuration */
#define pREG_AFE_DSWSTA                  ((__I      uint32_t  *) REG_AFE_DSWSTA)                  /*  Switch Matrix Status (D) */
#define pREG_AFE_PSWSTA                  ((__I      uint32_t  *) REG_AFE_PSWSTA)                  /*  Switch Matrix Status (P) */
#define pREG_AFE_NSWSTA                  ((__I      uint32_t  *) REG_AFE_NSWSTA)                  /*  Switch Matrix Status (N) */
#define pREG_AFE_TSWSTA                  ((__I      uint32_t  *) REG_AFE_TSWSTA)                  /*  Switch Matrix Status (T) */
#define pREG_AFE_STATSVAR                ((__I      uint32_t  *) REG_AFE_STATSVAR)                /*  Variance Output */
#define pREG_AFE_STATSCON                ((__IO     uint32_t  *) REG_AFE_STATSCON)                /*  Statistics Control */
#define pREG_AFE_STATSMEAN               ((__I      uint32_t  *) REG_AFE_STATSMEAN)               /*  Statistics Mean Output */
#define pREG_AFE_REPEATADCCNV            ((__IO     uint32_t  *) REG_AFE_REPEATADCCNV)            /*  REPEAT ADC Conversions */
#define pREG_AFE_CALDATLOCK              ((__IO     uint32_t  *) REG_AFE_CALDATLOCK)              /*  Calibration Data Lock */
#define pREG_AFE_ADCOFFSETHSTIA          ((__IO     uint32_t  *) REG_AFE_ADCOFFSETHSTIA)          /*  ADC Offset Calibration High Speed TIA Channel */
#define pREG_AFE_ADCGAINTEMPSENS0        ((__IO     uint32_t  *) REG_AFE_ADCGAINTEMPSENS0)        /*  ADC Gain Calibration Temp Sensor Channel */
#define pREG_AFE_ADCOFFSETTEMPSENS0      ((__IO     uint32_t  *) REG_AFE_ADCOFFSETTEMPSENS0)      /*  ADC Offset Calibration Temp Sensor Channel 0 */
#define pREG_AFE_ADCGAINGN1              ((__IO     uint32_t  *) REG_AFE_ADCGAINGN1)              /*  ADCPGAGN1: ADC Gain Calibration Auxiliary Input Channel */
#define pREG_AFE_ADCOFFSETGN1            ((__IO     uint32_t  *) REG_AFE_ADCOFFSETGN1)            /*  ADC Offset Calibration Auxiliary Channel (PGA Gain=1) */
#define pREG_AFE_DACGAIN                 ((__IO     uint32_t  *) REG_AFE_DACGAIN)                 /*  DACGAIN */
#define pREG_AFE_DACOFFSETATTEN          ((__IO     uint32_t  *) REG_AFE_DACOFFSETATTEN)          /*  DAC Offset with Attenuator Enabled (LP Mode) */
#define pREG_AFE_DACOFFSET               ((__IO     uint32_t  *) REG_AFE_DACOFFSET)               /*  DAC Offset with Attenuator Disabled (LP Mode) */
#define pREG_AFE_ADCGAINGN1P5            ((__IO     uint32_t  *) REG_AFE_ADCGAINGN1P5)            /*  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=1.5) */
#define pREG_AFE_ADCGAINGN2              ((__IO     uint32_t  *) REG_AFE_ADCGAINGN2)              /*  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=2) */
#define pREG_AFE_ADCGAINGN4              ((__IO     uint32_t  *) REG_AFE_ADCGAINGN4)              /*  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=4) */
#define pREG_AFE_ADCPGAOFFSETCANCEL      ((__IO     uint32_t  *) REG_AFE_ADCPGAOFFSETCANCEL)      /*  ADC Offset Cancellation (Optional) */
#define pREG_AFE_ADCGNHSTIA              ((__IO     uint32_t  *) REG_AFE_ADCGNHSTIA)              /*  ADC Gain Calibration for HS TIA Channel */
#define pREG_AFE_ADCOFFSETLPTIA0         ((__IO     uint32_t  *) REG_AFE_ADCOFFSETLPTIA0)         /*  ADC Offset Calibration ULP-TIA0 Channel */
#define pREG_AFE_ADCGNLPTIA0             ((__IO     uint32_t  *) REG_AFE_ADCGNLPTIA0)             /*  ADC GAIN Calibration for LP TIA0 Channel */
#define pREG_AFE_ADCPGAGN4OFCAL          ((__IO     uint32_t  *) REG_AFE_ADCPGAGN4OFCAL)          /*  ADC Gain Calibration with DC Cancellation(PGA G=4) */
#define pREG_AFE_ADCGAINGN9              ((__IO     uint32_t  *) REG_AFE_ADCGAINGN9)              /*  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=9) */
#define pREG_AFE_ADCOFFSETEMPSENS1       ((__IO     uint32_t  *) REG_AFE_ADCOFFSETEMPSENS1)       /*  ADC Offset Calibration  Temp Sensor Channel 1 */
#define pREG_AFE_ADCGAINTEMPSENS1        ((__IO     uint32_t  *) REG_AFE_ADCGAINTEMPSENS1)        /*  ADC Gain Calibration Temperature Sensor Channel */
#define pREG_AFE_DACOFFSETATTENHP        ((__IO     uint32_t  *) REG_AFE_DACOFFSETATTENHP)        /*  DAC Offset with Attenuator Enabled (HP Mode) */
#define pREG_AFE_DACOFFSETHP             ((__IO     uint32_t  *) REG_AFE_DACOFFSETHP)             /*  DAC Offset with Attenuator Disabled (HP Mode) */
#define pREG_AFE_ADCOFFSETLPTIA1         ((__IO     uint32_t  *) REG_AFE_ADCOFFSETLPTIA1)         /*  ADC Offset Calibration LP TIA1 Channel */
#define pREG_AFE_ADCGNLPTIA1             ((__IO     uint32_t  *) REG_AFE_ADCGNLPTIA1)             /*  ADC GAIN Calibration for LP TIA1 Channel */
#define pREG_AFE_ADCOFFSETGN2            ((__IO     uint32_t  *) REG_AFE_ADCOFFSETGN2)            /*  Offset Calibration Auxiliary Channel (PGA Gain =2) */
#define pREG_AFE_ADCOFFSETGN1P5          ((__IO     uint32_t  *) REG_AFE_ADCOFFSETGN1P5)          /*  Offset Calibration Auxiliary Channel (PGA Gain =1.5) */
#define pREG_AFE_ADCOFFSETGN9            ((__IO     uint32_t  *) REG_AFE_ADCOFFSETGN9)            /*  Offset Calibration Auxiliary Channel (PGA Gain =9) */
#define pREG_AFE_ADCOFFSETGN4            ((__IO     uint32_t  *) REG_AFE_ADCOFFSETGN4)            /*  Offset Calibration Auxiliary Channel (PGA Gain =4) */
#define pREG_AFE_PMBW                    ((__IO     uint32_t  *) REG_AFE_PMBW)                    /*  Power Mode Configuration */
#define pREG_AFE_SWMUX                   ((__IO     uint32_t  *) REG_AFE_SWMUX)                   /*  Switch Mux for ECG */
#define pREG_AFE_TEMPCON1                ((__IO     uint32_t  *) REG_AFE_TEMPCON1)                /*  AFE_TEMPSEN_DIO */
#define pREG_AFE_TESTDAC                 ((__IO     uint32_t  *) REG_AFE_TESTDAC)                 /*  DAC Test */
#define pREG_AFE_ADCBUFCON               ((__IO     uint32_t  *) REG_AFE_ADCBUFCON)               /*  Configure ADC Input Buffer */

